[
  {
    "id": "33a7c572-cdcf-4ec0-bbcd-a17fc10094be",
    "name": "5v3v1 Rondo Possession Drill",
    "description": "5v3v1 Rondo Possession Drillrondo drill soccer, possession training youth, transition rondo drill, switching play possession gameImagePrintRONDO DRILL SOCCER, POSSESSION TRAINING YOUTH, TRANSITION RONDO DRILL, SWITCHING PLAY POSSESSION GAMEDrill Quick GlanceAge: 10+Field: 20X20Players: 8+Focus: POSSESSIONDifficulty: MEDIUMTime: 20 mins.Goalkeeper: NOTEAMRating: 0 / 5Views: 1,054Published: 10/8/2025Author: Chris JohnsonDrill ObjectiveThis drill sharpens possession skills while teaching players to",
    "category": "Possession",
    "age_group": "10+",
    "player_count": "8+",
    "duration": "20 mins.",
    "difficulty": "MEDIUM",
    "has_goalkeeper": false,
    "setup_text": "• Mark out a 20x20 yard grid with cones\n• Divide players into one team of five and one team of three, each wearing different colored jerseys\n• From the team of five, position four players around the outside of the grid and one player inside\n• Place all three players from the team of three inside the grid\n• Have extra balls nearby to keep the drill moving\n• For teams with 16 or more players, set up two separate grids running simultaneously",
    "instructions_text": "1. Start with the team of three keeping possession against the single defender in a 3v1 rondo inside the grid\n2. The three attackers pass and move to maintain possession while the lone defender pressures\n3. When the single defender wins the ball, they immediately pass to any outside player\n4. Once the ball reaches an outside player, the game becomes a 5v3 rondo with four outside players and one inside player keeping possession\n5. The team of three now defends and tries to win the ball back\n6. As the single player passes to the outside, they switch roles with one of the three defenders who becomes the new single attacker\n7. The four outside players stay outside and work the ball around the perimeter while using the inside player\n8. If the team of three wins possession back, play immediately switches to a 3v1 rondo again inside the grid\n9. Continue this back and forth pattern as possession changes hands\n10. Keep score by awarding points for completing a set number of consecutive passes",
    "variations_text": "• Shrink the grid to 15x15 yards for advanced players to increase pressure and speed\n• Expand the grid to 25x25 yards for beginners who need more time and space\n• Limit all players to two touches to speed up play\n• Require one-touch passing for outside players only\n• Award bonus points for switching the ball from one side of the grid to the other\n• For teams of 14, play 7v7 with four outside, three inside as defenders, and seven inside attacking\n• Add a rule where the ball must go through the middle player before counting toward the pass total\n• Create a time limit where teams see how many passes they can complete in 90 seconds\n• Make outside players move along their side rather than staying in corners\n• Remove the switching rule and keep the same single player for 60 seconds before rotating",
    "coaching_points_text": "• The transition moment is critical - players must switch their mindset from attack to defense instantly\n• Inside attackers should constantly move to create passing angles and triangles of support\n• The single defender needs to be smart about pressure - cut off one passing lane to force a predictable pass\n• Outside players must stay alert and ready to receive even though they're not currently in the action\n• Body shape matters when receiving - open up to see multiple passing options\n• Quick one or two touch passing keeps the ball moving and makes defending harder\n• Defenders should work together to press and cover passing lanes as a unit\n• Communication is huge - call for the ball and let teammates know when pressure is coming\n• Players switching roles need to move quickly into their new position\n• The pace should stay high - this isn't a walking drill",
    "drill_json": {
      "name": "5v3v1 Rondo Possession Drill",
      "description": "Dynamic possession drill alternating between 3v1 and 5v3 scenarios based on ball possession changes",
      "field": {
        "type": "FULL",
        "attacking_direction": "NORTH",
        "markings": false,
        "goals": 0
      },
      "players": [
        {
          "id": "A1",
          "role": "ATTACKER",
          "position": {
            "x": 38,
            "y": 49
          }
        },
        {
          "id": "A2",
          "role": "ATTACKER",
          "position": {
            "x": 48,
            "y": 38
          }
        },
        {
          "id": "A3",
          "role": "ATTACKER",
          "position": {
            "x": 49,
            "y": 62
          }
        },
        {
          "id": "A4",
          "role": "ATTACKER",
          "position": {
            "x": 62,
            "y": 50
          }
        },
        {
          "id": "A5",
          "role": "ATTACKER",
          "position": {
            "x": 50,
            "y": 50
          }
        },
        {
          "id": "D1",
          "role": "DEFENDER",
          "position": {
            "x": 46,
            "y": 45
          }
        },
        {
          "id": "D2",
          "role": "DEFENDER",
          "position": {
            "x": 53,
            "y": 53
          }
        },
        {
          "id": "D3",
          "role": "DEFENDER",
          "position": {
            "x": 45,
            "y": 55
          }
        }
      ],
      "cones": [
        {
          "position": {
            "x": 40,
            "y": 40
          }
        },
        {
          "position": {
            "x": 60,
            "y": 40
          }
        },
        {
          "position": {
            "x": 40,
            "y": 60
          }
        },
        {
          "position": {
            "x": 60,
            "y": 60
          }
        }
      ],
      "cone_gates": [],
      "balls": [
        {
          "position": {
            "x": 45,
            "y": 55
          }
        }
      ],
      "mannequins": [],
      "actions": [
        {
          "type": "PASS",
          "from_player": "D3",
          "to_player": "D2"
        }
      ],
      "coaching_points": [
        "Quick decision making when possession changes",
        "Constant movement and communication",
        "Use both short and medium range passes",
        "Apply immediate pressure when defending"
      ],
      "variations": [
        "Limit touches for outside players",
        "Add time pressure with set durations",
        "Increase grid size for more technical players",
        "Award bonus points for using inside player"
      ]
    },
    "source": "soccerxpert.com",
    "source_url": "https://soccerxpert.com/drills/details/5v3v1-rondo-possession-drill",
    "published_at": "2026-01-03T01:06:15.090237"
  },
  {
    "id": "735583f5-dc01-4532-bfba-87ecab397e3c",
    "name": "5v3 Switching Rondo",
    "description": "5v3 Switching Rondoswitching play rondo, dual grid possession drill, transitional rondo soccer, movement and positioning drillImagePrintSWITCHING PLAY RONDO, DUAL GRID POSSESSION DRILL, TRANSITIONAL RONDO SOCCER, MOVEMENT AND POSITIONING DRILLDrill Quick GlanceAge: 9+Field: 12x24Players: 10Focus: POSSESSIONDifficulty: MEDIUMTime: 20 MINS.Goalkeeper: NOTEAMRating: 0 / 5Views: 1,334Published: 10/26/2025Author: Chris JohnsonDrill ObjectiveThis drill trains players to recognize when possession is lo",
    "category": "Possession",
    "age_group": "9+",
    "player_count": "10",
    "duration": "20 MINS.",
    "difficulty": "MEDIUM",
    "has_goalkeeper": false,
    "setup_text": "• Set up two 12x12 yard grids using cones with about 5 yards of space between them\n• Divide players into two teams of five, each wearing different colored jerseys\n• In the first grid, place five players from one team and three players from the opposing team\n• Position the remaining two players from the defending team in the second grid\n• Keep extra balls near the coach to maintain flow when balls go out of play",
    "instructions_text": "1. Start play with a 5v3 rondo in the first grid where five attackers work to maintain possession\n2. The three defenders press and try to win the ball\n3. When the three defenders win possession, they immediately switch play by passing to their two teammates waiting in the other grid\n4. As the ball travels to the second grid, three players from the original attacking team sprint to the second grid to defend\n5. The two players who were waiting now have three teammates join them to create a new 5v3 situation\n6. The two remaining players from the original attacking team stay in the first grid and wait\n7. Play continues with possession switching between grids each time the defending team wins the ball\n8. Rotate which three players transition to the other grid so everyone experiences different roles\n9. Keep the pace high and competitive throughout the drill",
    "variations_text": "• Increase grid size to 15x15 yards to make possession easier for developing players\n• Shrink grids to 10x10 yards to increase difficulty and speed up decision making\n• Limit all players to two touches to force quicker passing\n• Require one-touch passing only for an advanced challenge\n• Award points for completing a set number of passes before switching grids\n• Add a rule where the switch pass must be played in the air\n• Create a time challenge where teams see how many successful switches they can complete in two minutes\n• Require a specific player type to make the switch pass, like only the player who won the ball\n• Add small goals in each grid that the defending team can score on after winning possession\n• Make four players transition instead of three to increase the defensive challenge\n• Place a neutral player between the grids who must touch every switch pass",
    "coaching_points_text": "• The switch pass must be accurate and weighted properly to reach teammates in the other grid\n• Three players need to decide quickly who transitions to defend in the other grid\n• Players waiting in the empty grid should position themselves to receive the switch pass at good angles\n• Attackers in possession need constant movement to create passing options in tight space\n• First touch is critical in the small grid to keep the ball away from defenders\n• Defenders should press together and cut off passing lanes rather than chasing individually\n• Communication is huge during transitions so players know who's going and who's staying\n• Players transitioning to defend must sprint to apply pressure immediately in the new grid\n• The two waiting players should scan and anticipate when the switch might happen\n• Body shape when receiving matters to see multiple passing options and avoid pressure\n• Players staying behind should be ready in case the switch pass gets intercepted",
    "drill_json": {
      "name": "5v3 Switching Rondo",
      "description": "Two-grid possession drill where teams switch between grids when possession is lost, creating continuous 5v3 scenarios with rapid transitions",
      "field": {
        "type": "FULL",
        "attacking_direction": "NORTH",
        "markings": false,
        "goals": 0
      },
      "players": [
        {
          "id": "A1",
          "role": "ATTACKER",
          "position": {
            "x": 30,
            "y": 44
          }
        },
        {
          "id": "A2",
          "role": "ATTACKER",
          "position": {
            "x": 38,
            "y": 36
          }
        },
        {
          "id": "A3",
          "role": "ATTACKER",
          "position": {
            "x": 47,
            "y": 45
          }
        },
        {
          "id": "A4",
          "role": "ATTACKER",
          "position": {
            "x": 37,
            "y": 51
          }
        },
        {
          "id": "A5",
          "role": "ATTACKER",
          "position": {
            "x": 31,
            "y": 37
          }
        },
        {
          "id": "D1",
          "role": "DEFENDER",
          "position": {
            "x": 38,
            "y": 44
          }
        },
        {
          "id": "D2",
          "role": "DEFENDER",
          "position": {
            "x": 44,
            "y": 38
          }
        },
        {
          "id": "D3",
          "role": "DEFENDER",
          "position": {
            "x": 44,
            "y": 50
          }
        },
        {
          "id": "D4",
          "role": "DEFENDER",
          "position": {
            "x": 65,
            "y": 46
          }
        },
        {
          "id": "D5",
          "role": "DEFENDER",
          "position": {
            "x": 68,
            "y": 38
          }
        }
      ],
      "cones": [
        {
          "position": {
            "x": 26,
            "y": 32
          }
        },
        {
          "position": {
            "x": 38,
            "y": 32
          }
        },
        {
          "position": {
            "x": 50,
            "y": 32
          }
        },
        {
          "position": {
            "x": 26,
            "y": 44
          }
        },
        {
          "position": {
            "x": 50,
            "y": 44
          }
        },
        {
          "position": {
            "x": 26,
            "y": 56
          }
        },
        {
          "position": {
            "x": 38,
            "y": 56
          }
        },
        {
          "position": {
            "x": 50,
            "y": 56
          }
        },
        {
          "position": {
            "x": 56,
            "y": 32
          }
        },
        {
          "position": {
            "x": 68,
            "y": 32
          }
        },
        {
          "position": {
            "x": 80,
            "y": 32
          }
        },
        {
          "position": {
            "x": 56,
            "y": 44
          }
        },
        {
          "position": {
            "x": 80,
            "y": 44
          }
        },
        {
          "position": {
            "x": 56,
            "y": 56
          }
        },
        {
          "position": {
            "x": 68,
            "y": 56
          }
        },
        {
          "position": {
            "x": 80,
            "y": 56
          }
        }
      ],
      "cone_gates": [],
      "balls": [
        {
          "position": {
            "x": 38,
            "y": 44
          }
        }
      ],
      "mannequins": [],
      "actions": [
        {
          "type": "PASS",
          "from_player": "A1",
          "to_player": "A2"
        }
      ],
      "coaching_points": [
        "Maintain quick ball movement in 5v3 situations",
        "Transition rapidly when possession changes",
        "Communication is key during switches between grids",
        "Keep high intensity throughout transitions"
      ],
      "variations": [
        "Add touch restrictions (2-touch maximum)",
        "Increase grid size to 15x15 yards for more space",
        "Add neutral players who play with possession team",
        "Time each possession phase to add pressure"
      ]
    },
    "source": "soccerxpert.com",
    "source_url": "https://soccerxpert.com/drills/details/5v3-switching-rondo",
    "published_at": "2026-01-03T01:06:19.462719"
  },
  {
    "id": "856384c8-3517-40aa-b75c-e291851d6084",
    "name": "3-Man Box Passing Warmup",
    "description": "3-Man Box Passing WarmupPassing warm-up, opening up, movement, first touch, awarenessImagePrintPASSING WARM-UP, OPENING UP, MOVEMENT, FIRST TOUCH, AWARENESSDrill Quick GlanceAge: 9+Field: 10X10Players: 3+Focus: PASSINGDifficulty: MediumTime: 10 mins.Goalkeeper: NOINDIVIDUALRating: 0 / 5Views: 9,879Published: 5/8/2025Author: Chris JohnsonDrill ObjectiveThis drill focuses on teaching players how to open up their body, scan the field, and play accurate passes while moving continuously. It helps rei",
    "category": "Passing",
    "age_group": "9+",
    "player_count": "3+",
    "duration": "10 mins.",
    "difficulty": "Medium",
    "has_goalkeeper": false,
    "setup_text": "1. Field Size: 4x4 yard square created with cones or training sticks\n2. Players: 3 players per station\n1 worker inside the box\n2 passers positioned 7–10 yards away on adjacent sides of the box\n3. Equipment: 4 cones to create the box; optional colored cones for the variation",
    "instructions_text": "1. One of the passers plays a ball into the worker inside the box.\n2. The worker must open up, take a touch, and pass to the other outside passer.\n3. After the pass, the worker sprints around one of the four cones that form the box.\n4. The second passer returns the ball to the worker, and the sequence repeats in the opposite direction.\n5. Continue the cycle for 30-60 seconds, then rotate roles so each player gets time as the worker.",
    "variations_text": "• Color-Coded Cones: Use different colored cones at each corner; one of the passers calls out a color after each pass for the worker to move around.\n• One-Touch Passing: Advanced players can try one-touch play to increase difficulty.\n• Weak Foot Only: Require the worker to receive and pass only with their weaker foot.\n• Time Challenge: Count how many clean passes the group can complete in 60 seconds.\n• Two Workers: Add a second worker to increase intensity and decision-making.",
    "coaching_points_text": "• Open Body Shape: Players should receive on the half-turn to play quickly.\n• First Touch Direction: Touch should set up with the back foot for a clean pass to the next passer.\n• Scanning and Awareness: Workers should keep their eyes up to locate both passers and anticipate instructions.\n• Quick, Quality Movement: Sprint with purpose while keeping eyes on the ball while traveling around cones, resetting quickly for the next touch.\n• Accurate Passing: Ensure each pass is played with proper weight and direction.",
    "drill_json": {
      "name": "3-Man Box Passing Warmup",
      "description": "Technical passing drill with one player working inside a 4x4 yard box, receiving passes from two outside players and moving around cones between passes",
      "field": {
        "type": "FULL",
        "attacking_direction": "NORTH",
        "markings": false,
        "goals": 0
      },
      "players": [
        {
          "id": "A1",
          "role": "ATTACKER",
          "position": {
            "x": 51,
            "y": 50
          }
        },
        {
          "id": "A2",
          "role": "ATTACKER",
          "position": {
            "x": 51,
            "y": 38
          }
        },
        {
          "id": "A3",
          "role": "ATTACKER",
          "position": {
            "x": 60,
            "y": 50
          }
        }
      ],
      "cones": [
        {
          "position": {
            "x": 48,
            "y": 48
          }
        },
        {
          "position": {
            "x": 52,
            "y": 48
          }
        },
        {
          "position": {
            "x": 48,
            "y": 52
          }
        },
        {
          "position": {
            "x": 52,
            "y": 52
          }
        }
      ],
      "cone_gates": [],
      "balls": [
        {
          "position": {
            "x": 42,
            "y": 58
          }
        }
      ],
      "mannequins": [],
      "actions": [
        {
          "type": "PASS",
          "from_player": "A2",
          "to_player": "A1"
        },
        {
          "type": "PASS",
          "from_player": "A1",
          "to_player": "A3"
        },
        {
          "type": "RUN",
          "player": "A1",
          "to_position": {
            "x": 48,
            "y": 54
          }
        },
        {
          "type": "RUN",
          "player": "A1",
          "to_position": {
            "x": 46,
            "y": 50
          }
        },
        {
          "type": "RUN",
          "player": "A1",
          "to_position": {
            "x": 51,
            "y": 50
          }
        }
      ],
      "coaching_points": [
        "Worker should open up body to see both passers",
        "Take touch away from pressure to create passing angle",
        "Sprint around cone after each pass to maintain intensity",
        "Outside passers should provide accurate passes to worker's feet"
      ],
      "variations": [
        "Use colored cones for specific running patterns",
        "Add time pressure - count successful passes in 60 seconds",
        "Worker must use only one touch",
        "Add a fourth player as passive defender"
      ]
    },
    "source": "soccerxpert.com",
    "source_url": "https://soccerxpert.com/drills/details/3-man-box-passing-warmup",
    "published_at": "2026-01-03T01:06:23.152297"
  },
  {
    "id": "d47e5290-1fd2-4ac4-b185-e9510de8cbc1",
    "name": "6v1 Overload Add Defenders Drill",
    "description": "6v1 Overload Add Defenders Drilloverload training soccer, progressive possession drill, add defenders rondo, transitional defense drillImagePrintOVERLOAD TRAINING SOCCER, PROGRESSIVE POSSESSION DRILL, ADD DEFENDERS RONDO, TRANSITIONAL DEFENSE DRILLDrill Quick GlanceAge: 13+Field: 20X25Players: 12+Focus: POSSESSIONDifficulty: MEDIUMTime: 20 mins.Goalkeeper: NOTEAMRating: 0 / 5Views: 1,328Published: 10/10/2025Author: Chris JohnsonDrill ObjectiveThis drill builds players' ability to think quickly a",
    "category": "Possession",
    "age_group": "13+",
    "player_count": "12+",
    "duration": "20 mins.",
    "difficulty": "MEDIUM",
    "has_goalkeeper": false,
    "setup_text": "• Create a square or rectangular grid using cones, sized 20x20 yards for younger players or 30x30 yards for older players\n• Place one defender in the grid to start\n• Position six attackers inside the grid with one player starting with the ball\n• Keep the remaining players outside the area ready to enter as additional defenders\n• Have extra balls nearby to restart play quickly when needed",
    "instructions_text": "1. The attacking team begins play by passing and moving to keep possession away from the single defender\n2. Attackers try to complete as many consecutive passes as possible\n3. Add a new defender when the attackers reach a set number of passes, such as 5 or 10 consecutive completions\n4. When possession changes, the attacking team starts their pass count from zero\n5. Continue adding defenders each time the pass target is reached\n6. The drill progresses from 6v1 to 6v2, then 6v3, and continues until a set time limit or number of defenders is reached\n7. Reset the drill or rotate players after reaching the predetermined endpoint",
    "variations_text": "• Limit attackers to two touches or one touch only to increase speed and sharpness\n• Award points to defenders if they force the ball out of bounds to increase their motivation\n• Require attackers to complete a minimum number of passes before they can score through a mini-goal\n• Create zones where the ball must enter before a pass counts toward the total\n• Add a rule where attackers must use both feet or alternate which foot they use\n• Place restrictions on where defenders can position themselves initially to give attackers time to settle\n• Make defenders do a physical challenge like five pushups before entering the grid\n• Track which group of attackers can complete the most passes before losing possession",
    "coaching_points_text": "• Attackers need to scan constantly to find open teammates and identify where space exists\n• Communication is essential as pressure builds. Simple calls help teammates know support is available\n• First touch must move the ball away from pressure and into space where the next pass opens up\n• Players without the ball should make sharp runs at angles to create clear passing lanes\n• As more defenders enter, attackers must spread wider to stretch the defense\n• The closest defender to the ball should apply immediate pressure to limit time and space\n• Defenders must stay patient and avoid diving in, which creates gaps for attackers to exploit\n• Defensive players should work together to cut off passing options and force mistakes\n• Watch for the transition moment when the ball turns over. Instant pressure or instant support makes the difference\n• Players switching from attack to defense need to recover quickly with their head up looking for the ball",
    "drill_json": {
      "name": "6v1 Overload Add Defenders Drill",
      "description": "Progressive possession drill starting with 6 attackers vs 1 defender. Additional defenders are added each time attackers reach target consecutive passes (5-10). Develops possession under increasing pressure.",
      "field": {
        "type": "FULL",
        "attacking_direction": "NORTH",
        "markings": false,
        "goals": 0
      },
      "players": [
        {
          "id": "A1",
          "role": "ATTACKER",
          "position": {
            "x": 45,
            "y": 45
          }
        },
        {
          "id": "A2",
          "role": "ATTACKER",
          "position": {
            "x": 55,
            "y": 47
          }
        },
        {
          "id": "A3",
          "role": "ATTACKER",
          "position": {
            "x": 42,
            "y": 52
          }
        },
        {
          "id": "A4",
          "role": "ATTACKER",
          "position": {
            "x": 58,
            "y": 53
          }
        },
        {
          "id": "A5",
          "role": "ATTACKER",
          "position": {
            "x": 47,
            "y": 57
          }
        },
        {
          "id": "A6",
          "role": "ATTACKER",
          "position": {
            "x": 53,
            "y": 55
          }
        },
        {
          "id": "D1",
          "role": "DEFENDER",
          "position": {
            "x": 50,
            "y": 50
          }
        },
        {
          "id": "D2",
          "role": "DEFENDER",
          "position": {
            "x": 65,
            "y": 45
          }
        },
        {
          "id": "D3",
          "role": "DEFENDER",
          "position": {
            "x": 65,
            "y": 50
          }
        },
        {
          "id": "D4",
          "role": "DEFENDER",
          "position": {
            "x": 65,
            "y": 55
          }
        },
        {
          "id": "D5",
          "role": "DEFENDER",
          "position": {
            "x": 70,
            "y": 47
          }
        },
        {
          "id": "D6",
          "role": "DEFENDER",
          "position": {
            "x": 70,
            "y": 53
          }
        }
      ],
      "cones": [
        {
          "position": {
            "x": 40,
            "y": 40
          }
        },
        {
          "position": {
            "x": 60,
            "y": 40
          }
        },
        {
          "position": {
            "x": 40,
            "y": 60
          }
        },
        {
          "position": {
            "x": 60,
            "y": 60
          }
        }
      ],
      "cone_gates": [],
      "balls": [
        {
          "position": {
            "x": 45,
            "y": 45
          }
        }
      ],
      "mannequins": [],
      "actions": [
        {
          "type": "PASS",
          "from_player": "A1",
          "to_player": "A2"
        },
        {
          "type": "PASS",
          "from_player": "A2",
          "to_player": "A6"
        },
        {
          "type": "RUN",
          "player": "D2",
          "to_position": {
            "x": 58,
            "y": 48
          }
        }
      ],
      "coaching_points": [
        "Keep your head up to see all passing options",
        "Move the ball quickly before defenders can close down",
        "Create space by moving away from teammates",
        "Use the entire grid space - don't bunch up in center",
        "Support the player with the ball with multiple passing angles"
      ],
      "variations": [
        "Start with different attacker to defender ratios (5v1, 7v1)",
        "Change the pass target before adding defenders (3, 8, 12 passes)",
        "Add time pressure - must make decision within 3 seconds",
        "Require minimum 2 touches or maximum 3 touches per player",
        "Add condition that ball must be played to each attacker before counting passes"
      ]
    },
    "source": "soccerxpert.com",
    "source_url": "https://soccerxpert.com/drills/details/6v1-overload-add-defenders-drill",
    "published_at": "2026-01-03T01:06:27.335549"
  },
  {
    "id": "b34808ef-9a84-4c49-beb6-209ae01a74d1",
    "name": "4v4+2 Endzone Possession Game",
    "description": "4v4+2 Endzone Possession Gamepossession drill soccer, rondo progression drill, endzone passing game, youth soccer possession trainingImagePrintPOSSESSION DRILL SOCCER, RONDO PROGRESSION DRILL, ENDZONE PASSING GAME, YOUTH SOCCER POSSESSION TRAININGDrill Quick GlanceAge: 10+Field: 12x20Players: 12+Focus: POSSESSIONDifficulty: MEDIUMTime: 20 MINS.Goalkeeper: NOTeamRating: 0 / 5Views: 991Published: 10/8/2025Author: Chris JohnsonDrill ObjectiveThis drill develops players' ability to keep possession u",
    "category": "Possession",
    "age_group": "10+",
    "player_count": "12+",
    "duration": "20 MINS.",
    "difficulty": "MEDIUM",
    "has_goalkeeper": false,
    "setup_text": "• Create a 12x20 yard grid using cones\n• Mark two endzones that are 3x12 yards on each end of the grid\n• Divide your team into two groups of six players each, plus select two neutral players\n• Place four players from each team in the central playing area\n• Position one player from each team in each endzone\n• Station the two neutral players outside the long sides of the grid\n• Keep a supply of balls near the coach to restart play quickly",
    "instructions_text": "1. Start the game with one team in possession in the center grid\n2. The team with the ball plays 4v4 in the middle, using the two neutral outside players as passing options\n3. Players can pass to their teammate in the endzone to help maintain possession\n4. The endzone player must move to find open space and good angles to receive\n5. When an endzone player receives the ball, they can dribble out of the zone to join the game\n6. If the endzone player dribbles out, they switch positions with the player who passed them the ball\n7. Exception: if a neutral player passes to the endzone, no position switch happens and the ball must be passed back out\n8. When the other team wins the ball, they immediately try to keep possession and use their endzone player\n9. Start as a simple rondo with no scoring to let players learn the pattern\n10. Progress to scoring one point for completing a set number of consecutive passes\n11. Next progression: score one point for passing to the endzone and keeping possession\n12. Final progression: score one point for passing to one endzone, keeping the ball, then passing to the opposite endzone",
    "variations_text": "• Limit touches in the middle to two or one touch to increase the speed of play\n• Remove the neutral players to make it a true 4v4 and increase defensive pressure\n• Add a rule that the endzone player must receive the ball before the team can score\n• Make it directional where teams can only score in one specific endzone\n• Require the ball to touch the endzone player twice before a point counts\n• Change the number of passes needed for a point based on your team's skill level\n• Allow the defending team to send one player into the endzone to pressure\n• Give bonus points for one-touch passes to or from the endzone player\n• Shrink the grid size to increase pressure and speed up decision-making",
    "coaching_points_text": "• Players need to scan before receiving the ball to know where pressure is coming from and where space exists\n• First touch should move the ball into space away from defenders, not just stop it\n• The endzone player can't stand still - they must move side to side to create passing angles\n• Players in the middle should constantly check their shoulders to stay aware of all options\n• Speed of play matters - one or two touch passing breaks down the defense faster than holding the ball\n• Body shape when receiving is key - open up to see the whole field\n• Players off the ball need to move into passing lanes and create triangles of support\n• Communication helps - call for the ball when you're open but keep it simple and clear\n• When defending, work together to press as a unit and cut off passing lanes\n• The neutral players should move up and down their line to stay available at the right angle",
    "drill_json": {
      "name": "4v4+2 Endzone Possession Game",
      "description": "A possession drill with two teams of 4 playing in the center, supported by 2 neutral players and endzone teammates. Teams maintain possession and can switch positions when passing to endzones.",
      "field": {
        "type": "FULL",
        "attacking_direction": "NORTH",
        "markings": false,
        "goals": 0
      },
      "players": [
        {
          "id": "A1",
          "role": "ATTACKER",
          "position": {
            "x": 45,
            "y": 52
          }
        },
        {
          "id": "A2",
          "role": "ATTACKER",
          "position": {
            "x": 51,
            "y": 60
          }
        },
        {
          "id": "A3",
          "role": "ATTACKER",
          "position": {
            "x": 52,
            "y": 54
          }
        },
        {
          "id": "A4",
          "role": "ATTACKER",
          "position": {
            "x": 55,
            "y": 48
          }
        },
        {
          "id": "A5",
          "role": "ATTACKER",
          "position": {
            "x": 53,
            "y": 41
          }
        },
        {
          "id": "A6",
          "role": "ATTACKER",
          "position": {
            "x": 47,
            "y": 68
          }
        },
        {
          "id": "D1",
          "role": "DEFENDER",
          "position": {
            "x": 47,
            "y": 50
          }
        },
        {
          "id": "D2",
          "role": "DEFENDER",
          "position": {
            "x": 53,
            "y": 56
          }
        },
        {
          "id": "D3",
          "role": "DEFENDER",
          "position": {
            "x": 51,
            "y": 52
          }
        },
        {
          "id": "D4",
          "role": "DEFENDER",
          "position": {
            "x": 49,
            "y": 46
          }
        },
        {
          "id": "D5",
          "role": "DEFENDER",
          "position": {
            "x": 53,
            "y": 69
          }
        },
        {
          "id": "D6",
          "role": "DEFENDER",
          "position": {
            "x": 48,
            "y": 41
          }
        },
        {
          "id": "N1",
          "role": "NEUTRAL",
          "position": {
            "x": 42,
            "y": 55
          }
        },
        {
          "id": "N2",
          "role": "NEUTRAL",
          "position": {
            "x": 58,
            "y": 55
          }
        }
      ],
      "cones": [
        {
          "position": {
            "x": 44,
            "y": 40
          }
        },
        {
          "position": {
            "x": 56,
            "y": 40
          }
        },
        {
          "position": {
            "x": 44,
            "y": 70
          }
        },
        {
          "position": {
            "x": 56,
            "y": 70
          }
        },
        {
          "position": {
            "x": 44,
            "y": 43
          }
        },
        {
          "position": {
            "x": 56,
            "y": 43
          }
        },
        {
          "position": {
            "x": 44,
            "y": 67
          }
        },
        {
          "position": {
            "x": 56,
            "y": 67
          }
        }
      ],
      "cone_gates": [],
      "balls": [
        {
          "position": {
            "x": 45,
            "y": 52
          }
        }
      ],
      "mannequins": [],
      "actions": [
        {
          "type": "PASS",
          "from_player": "A1",
          "to_player": "A2"
        },
        {
          "type": "PASS",
          "from_player": "A2",
          "to_player": "A6"
        },
        {
          "type": "DRIBBLE",
          "player": "A6",
          "to_position": {
            "x": 47,
            "y": 60
          }
        },
        {
          "type": "RUN",
          "player": "A2",
          "to_position": {
            "x": 50,
            "y": 68
          }
        }
      ],
      "coaching_points": [
        "Endzone players must move to create good passing angles",
        "When passing to endzone, be ready to switch positions if they dribble out",
        "Use neutral players to maintain possession under pressure",
        "Quick ball movement to find the open endzone player"
      ],
      "variations": [
        "Start as simple rondo with no scoring",
        "Score points for consecutive passes",
        "Score for passing to endzone and keeping possession",
        "Score for passing to both endzones in sequence"
      ]
    },
    "source": "soccerxpert.com",
    "source_url": "https://soccerxpert.com/drills/details/endzone-possession-game",
    "published_at": "2026-01-03T01:06:32.483660"
  },
  {
    "id": "101401ed-46ae-4e05-8f71-87e16ea81239",
    "name": "1v1 Corner Escape",
    "description": "1v1 Corner Escape1v1 escape, tight space dribbling, pressure, decision-making, first touchImagePrint1V1 ESCAPE, TIGHT SPACE DRIBBLING, PRESSURE, DECISION-MAKING, FIRST TOUCHDrill Quick GlanceAge: 9+Field: 6X6Players: 4+Focus: ATTACKINGDifficulty: MEDIUMTime: 10 mins.Goalkeeper: NOINDIVIDUALRating: 0 / 5Views: 13,945Published: 4/1/2025Author: Chris JohnsonDrill ObjectiveThis drill sharpens a player’s ability to receive under pressure, recognize defensive cues, and dribble into space. It emphasize",
    "category": "Dribbling",
    "age_group": "9+",
    "player_count": "4+",
    "duration": "10 mins.",
    "difficulty": "MEDIUM",
    "has_goalkeeper": false,
    "setup_text": "1. Field Size: 6x6 yard grid\n2. Gates: Three 1-yard gates on three sides of the corner grid\nThe middle gate is placed diagonally, facing the opposite cone\n3. Players: 4 players per grid\n4. 3 players with balls at the diagonal gate\n5. 1 player without a ball at the opposite cone",
    "instructions_text": "1. One of the players with a ball passes to the player on the opposite cone, who must receive the ball in the corner of the grid.\n2. Immediately after the pass, the passer becomes the defender and applies pressure.\n3. The receiving player must attempt to dribble through one of the three gates to escape the corner.\n4. A point is scored only if the ball is dribbled through a gate (no points for passing through).\n5. The receiver must read the pressure and decide whether to take a close control touch or a larger touch to escape around the defender.\n6. Rotate roles so all players have a chance to attack and defend.",
    "variations_text": "• Touch Limit: Allow only two touches to escape for added challenge.\n• Defender Delay: Defender must count to 1 before applying pressure to simulate real timing.\n• Smaller Gates: Narrow the gates to demand more precise control and execution.\n• Left/Right Only Rounds: Restrict dribbling escape to specific gates to work on directional skills.\n• Add a Timer: Players must escape within 5 seconds to encourage quick decision-making.",
    "coaching_points_text": "• First Touch Awareness: Encourage players to take touches based on the pressure — small if unpressured, big if defender is tight.\n• Read the Defender: Attackers must scan quickly and choose the right gate to escape through.\n• Body Positioning: Receive the ball on the half-turn to see both the field and the defender.\n• Defensive Pressure: Defenders should close down quickly and angle their approach to limit escape options.\n• Acceleration: Once an escape route is chosen, explode into space with speed.",
    "drill_json": {
      "name": "1v1 Corner Escape",
      "description": "A 1v1 drill where players must escape from a corner grid through one of three gates while under pressure from a defender",
      "field": {
        "type": "FULL",
        "attacking_direction": "NORTH",
        "markings": false,
        "goals": 0
      },
      "players": [
        {
          "id": "A1",
          "role": "ATTACKER",
          "position": {
            "x": 50.5,
            "y": 50.5
          }
        },
        {
          "id": "D1",
          "role": "DEFENDER",
          "position": {
            "x": 55,
            "y": 55
          }
        }
      ],
      "cones": [
        {
          "position": {
            "x": 50,
            "y": 50
          }
        },
        {
          "position": {
            "x": 56,
            "y": 50
          }
        },
        {
          "position": {
            "x": 56,
            "y": 51
          }
        },
        {
          "position": {
            "x": 50,
            "y": 56
          }
        },
        {
          "position": {
            "x": 51,
            "y": 56
          }
        },
        {
          "position": {
            "x": 55,
            "y": 56
          }
        },
        {
          "position": {
            "x": 56,
            "y": 55
          }
        }
      ],
      "cone_gates": [],
      "balls": [
        {
          "position": {
            "x": 47,
            "y": 53
          }
        },
        {
          "position": {
            "x": 47,
            "y": 47
          }
        },
        {
          "position": {
            "x": 47,
            "y": 49
          }
        }
      ],
      "mannequins": [],
      "actions": [
        {
          "type": "PASS",
          "from_player": "D1",
          "to_player": "A1"
        },
        {
          "type": "RUN",
          "player": "D1",
          "to_position": {
            "x": 50,
            "y": 51
          }
        },
        {
          "type": "DRIBBLE",
          "player": "A1",
          "to_position": {
            "x": 50.5,
            "y": 56
          }
        }
      ],
      "coaching_points": [
        "Receive with back to goal and assess pressure immediately",
        "Use close control touch when defender is close, larger touch when space is available",
        "Keep body between ball and defender while escaping",
        "Defender should apply immediate pressure after passing"
      ],
      "variations": [
        "Add time limit for escape (5-8 seconds)",
        "Increase grid size to 8x8 or 10x10 yards",
        "Add a fourth gate for more escape options",
        "Require specific foot or move to go through each gate"
      ]
    },
    "source": "soccerxpert.com",
    "source_url": "https://soccerxpert.com/drills/details/1v1-escape-the-corner",
    "published_at": "2026-01-03T01:06:37.920371"
  },
  {
    "id": "65b863da-a204-4dc4-a2cf-3a5c36677676",
    "name": "3v1 Rondo",
    "description": "3v1 Rondo3v1 rondo drill, basic possession drill soccer, youth rondo training, small sided possession gameImagePrint3V1 RONDO DRILL, BASIC POSSESSION DRILL SOCCER, YOUTH RONDO TRAINING, SMALL SIDED POSSESSION GAMEDrill Quick GlanceAge: 9+Field: 5X5Players: 4+Focus: POSSESSIONDifficulty: EASYTime: 10 MINS.Goalkeeper: NOTEAMRating: 0 / 5Views: 1,238Published: 10/9/2025Author: Chris JohnsonDrill ObjectiveThis drill builds the foundation of possession soccer by teaching players how to keep the ball ",
    "category": "Possession",
    "age_group": "9+",
    "player_count": "4+",
    "duration": "10 MINS.",
    "difficulty": "EASY",
    "has_goalkeeper": false,
    "setup_text": "• Create a 5x5 yard grid with cones\n• Assign four players to each grid\n• Designate one player as the starting defender\n• The other three players position themselves around the grid as attackers\n• Each grid needs one ball to start\n• Set up multiple grids if you have more than four players to maximize touches",
    "instructions_text": "1. The three attacking players start with possession and work to keep the ball away from the defender\n2. All attacking players are limited to two touches maximum\n3. Players pass and move constantly to create passing angles\n4. The defender pressures the ball and works to win possession or force the ball out of bounds\n5. If the defender wins the ball, the player who lost it becomes the new defender\n6. If an attacker passes the ball out of bounds, that player becomes the defender\n7. Play continues with the new defender immediately pressing\n8. Keep the tempo high with quick restarts after each turnover\n9. Rotate through multiple rounds so everyone experiences defending",
    "variations_text": "• Shrink the grid to 4x4 yards for advanced players to increase difficulty\n• Expand to 10x10 yards for beginners who need more time and space\n• Limit players to one touch to speed up play dramatically\n• Allow unlimited touches for younger players still learning the pattern\n• Add a second defender to make it 3v2 and increase pressure\n• Award points for completing a certain number of consecutive passes\n• Require the ball to go through all three attackers before counting toward a pass total\n• Make attackers use only their weak foot\n• Allow the defender to win by forcing five turnovers, then rotate to a new defender\n• Create a rule where players must move after every pass they make",
    "coaching_points_text": "• Attackers should form a triangle shape around the defender to create the best passing angles\n• Movement without the ball is just as important as the pass itself\n• Players need to open their body when receiving so they can see both the ball and their next passing option\n• Use the back foot to receive passes when possible because it opens up more of the field\n• Look at one teammate but pass to another to deceive the defender\n• Passes should be firm and accurate to feet, not soft or behind the receiver\n• The first touch should set up the second touch, not just stop the ball\n• Players should constantly adjust their distance from each other based on where the defender is\n• Quick feet and body feints help sell a fake pass or movement\n• The defender should pressure intelligently and try to force passes into predictable areas\n• Communication helps but keep it simple and quick",
    "drill_json": {
      "name": "3v1 Rondo",
      "description": "Three attacking players work to keep possession away from one defender in a small grid using quick passing and movement with a two-touch limit.",
      "field": {
        "type": "FULL",
        "attacking_direction": "NORTH",
        "markings": false,
        "goals": 0
      },
      "players": [
        {
          "id": "A1",
          "role": "ATTACKER",
          "position": {
            "x": 48.5,
            "y": 48
          }
        },
        {
          "id": "A2",
          "role": "ATTACKER",
          "position": {
            "x": 52,
            "y": 49
          }
        },
        {
          "id": "A3",
          "role": "ATTACKER",
          "position": {
            "x": 50,
            "y": 52
          }
        },
        {
          "id": "D1",
          "role": "DEFENDER",
          "position": {
            "x": 50,
            "y": 50
          }
        }
      ],
      "cones": [
        {
          "position": {
            "x": 47.5,
            "y": 47.5
          }
        },
        {
          "position": {
            "x": 52.5,
            "y": 47.5
          }
        },
        {
          "position": {
            "x": 47.5,
            "y": 52.5
          }
        },
        {
          "position": {
            "x": 52.5,
            "y": 52.5
          }
        }
      ],
      "cone_gates": [],
      "balls": [
        {
          "position": {
            "x": 47,
            "y": 47
          }
        }
      ],
      "mannequins": [],
      "actions": [
        {
          "type": "PASS",
          "from_player": "A1",
          "to_player": "A2"
        }
      ],
      "coaching_points": [
        "Maximum two touches per player",
        "Keep passing angles open with constant movement",
        "Quick decision making under pressure",
        "Defender applies immediate pressure to ball carrier",
        "Player who loses possession becomes new defender"
      ],
      "variations": [
        "Increase grid size to 8x8 yards for more space",
        "Add one-touch passing requirement",
        "Include specific number of passes before switching roles",
        "Add neutral player who always plays with possession team"
      ]
    },
    "source": "soccerxpert.com",
    "source_url": "https://soccerxpert.com/drills/details/3v1-rondo-drill",
    "published_at": "2026-01-03T01:06:42.370237"
  },
  {
    "id": "670b1106-432e-4668-b7a9-e4f35c03adc2",
    "name": "11v5 Positional Rondo",
    "description": "11v5 Positional Rondopositional rondo drill, 11v5 possession training, shape and possession drill, tactical rondo soccerImagePrintPOSITIONAL RONDO DRILL, 11V5 POSSESSION TRAINING, SHAPE AND POSSESSION DRILL, TACTICAL RONDO SOCCERDrill Quick GlanceAge: 13+Field: 20X25Players: 16+Focus: Game-likeDifficulty: MEDIUMTime: 20 mins.Goalkeeper: YESTEAMRating: 0 / 5Views: 1,093Published: 10/9/2025Author: Chris JohnsonDrill ObjectiveThis drill teaches your full team to keep possession while maintaining po",
    "category": "Possession",
    "age_group": "13+",
    "player_count": "16+",
    "duration": "20 mins.",
    "difficulty": "MEDIUM",
    "has_goalkeeper": true,
    "setup_text": "• Set up a 20x25 yard grid using cones\n• Place two small goals on one end of the grid for the defending team to attack\n• Divide your squad into a team of 11 and a team of 5, each wearing different colored jerseys\n• Position the team of 11 in their actual game formation inside the grid\n• Place the five defenders anywhere inside the grid to start\n• Have plenty of balls ready near the coach to restart play quickly",
    "instructions_text": "1. The team of 11 starts with possession and works to keep the ball while staying in their assigned positions\n2. Each player must remain in their positional area throughout the drill\n3. Players pass and move within their zone to create angles and maintain possession\n4. The five defenders press and work together to win the ball\n5. Award the team of 11 one point after they complete a set number of consecutive passes\n6. If the defending team wins possession, they immediately attack the two small goals\n7. The team of 11 transitions to defense and tries to stop the counterattack\n8. After a goal or the ball goes out, restart with the team of 11 in possession\n9. Rotate defenders every few minutes so different players experience the high intensity defensive work\n10. Keep the tempo high and competitive throughout",
    "variations_text": "• Shrink the grid to 15x20 yards for advanced teams to increase pressure\n• Expand to 25x30 yards for younger or less experienced players\n• Limit the team of 11 to two touches to speed up decision making\n• Add a sixth or seventh defender to increase difficulty\n• Require the ball to go through specific positions before a point counts\n• Award bonus points for completing passes through certain zones like the middle third\n• Make the team of 11 complete a set passing pattern before earning points\n• Allow defenders to score double points on goals to increase their motivation\n• Create zones where only certain positions can receive the ball\n• Time each possession phase and track how long the team of 11 can keep the ball\n• Switch to one-touch passing in certain areas of the grid",
    "coaching_points_text": "• Players must understand their position's responsibilities and stay disciplined in their area\n• Spacing is critical - players too close together makes defending easier\n• The ball should move faster than the defenders can press\n• Players need to check their shoulders constantly to know where pressure is coming from\n• Support angles should form triangles so the player with the ball always has two passing options\n• First touch should be clean and move the ball into space, not back toward pressure\n• Defenders must communicate and work as a unit to cut off passing lanes\n• When the ball switches sides, players on the far side need to adjust their position\n• The team of 11 should stay composed when pressed - no panic passes\n• After losing the ball, the nearest players must pressure immediately to slow the counterattack\n• Look for players scanning before receiving - this habit needs to become automatic",
    "drill_json": {
      "name": "11v5 Positional Rondo",
      "description": "A possession drill where 11 players in formation maintain possession against 5 defenders, with quick transition to attack small goals when defenders win the ball",
      "field": {
        "type": "FULL",
        "attacking_direction": "NORTH",
        "markings": false,
        "goals": 0
      },
      "players": [
        {
          "id": "GK",
          "role": "ATTACKER",
          "position": {
            "x": 50,
            "y": 38
          }
        },
        {
          "id": "A1",
          "role": "ATTACKER",
          "position": {
            "x": 33,
            "y": 46
          }
        },
        {
          "id": "A2",
          "role": "ATTACKER",
          "position": {
            "x": 67,
            "y": 46
          }
        },
        {
          "id": "A3",
          "role": "ATTACKER",
          "position": {
            "x": 43,
            "y": 43
          }
        },
        {
          "id": "A4",
          "role": "ATTACKER",
          "position": {
            "x": 57,
            "y": 43
          }
        },
        {
          "id": "A5",
          "role": "ATTACKER",
          "position": {
            "x": 30,
            "y": 53
          }
        },
        {
          "id": "A6",
          "role": "ATTACKER",
          "position": {
            "x": 70,
            "y": 53
          }
        },
        {
          "id": "A7",
          "role": "ATTACKER",
          "position": {
            "x": 50,
            "y": 49
          }
        },
        {
          "id": "A8",
          "role": "ATTACKER",
          "position": {
            "x": 40,
            "y": 58
          }
        },
        {
          "id": "A9",
          "role": "ATTACKER",
          "position": {
            "x": 60,
            "y": 58
          }
        },
        {
          "id": "A10",
          "role": "ATTACKER",
          "position": {
            "x": 50,
            "y": 62
          }
        },
        {
          "id": "D1",
          "role": "DEFENDER",
          "position": {
            "x": 45,
            "y": 48
          }
        },
        {
          "id": "D2",
          "role": "DEFENDER",
          "position": {
            "x": 55,
            "y": 52
          }
        },
        {
          "id": "D3",
          "role": "DEFENDER",
          "position": {
            "x": 37,
            "y": 57
          }
        },
        {
          "id": "D4",
          "role": "DEFENDER",
          "position": {
            "x": 62,
            "y": 57
          }
        },
        {
          "id": "D5",
          "role": "DEFENDER",
          "position": {
            "x": 50,
            "y": 55
          }
        }
      ],
      "cones": [
        {
          "position": {
            "x": 25,
            "y": 38
          }
        },
        {
          "position": {
            "x": 75,
            "y": 38
          }
        },
        {
          "position": {
            "x": 25,
            "y": 63
          }
        },
        {
          "position": {
            "x": 75,
            "y": 63
          }
        }
      ],
      "cone_gates": [
        {
          "id": "G1",
          "center": {
            "x": 40,
            "y": 38
          },
          "width": 4,
          "orientation": "HORIZONTAL"
        },
        {
          "id": "G2",
          "center": {
            "x": 60,
            "y": 38
          },
          "width": 4,
          "orientation": "HORIZONTAL"
        }
      ],
      "balls": [
        {
          "position": {
            "x": 50,
            "y": 50
          }
        }
      ],
      "mannequins": [],
      "actions": [
        {
          "type": "PASS",
          "from_player": "A3",
          "to_player": "A1"
        }
      ],
      "coaching_points": [
        "Players must stay in their positional zones throughout the drill",
        "Quick passing and movement within zones to create passing angles",
        "Defenders work together with high intensity pressing",
        "Immediate transition when possession changes hands",
        "Keep tempo high and competitive"
      ],
      "variations": [
        "Change the number of consecutive passes required for a point",
        "Adjust grid size to make it easier or harder",
        "Add time limits for possession phases",
        "Use different formations for the team of 11"
      ]
    },
    "source": "soccerxpert.com",
    "source_url": "https://soccerxpert.com/drills/details/11v5-positional-rondo",
    "published_at": "2026-01-03T01:06:46.365105"
  },
  {
    "id": "bd75f1fe-796d-4d7b-bb0d-6aaa3c1bdf24",
    "name": "3v1 Transition Rondo",
    "description": "3v1 Transition Rondo3v1 Transition RondoImagePrint3V1 TRANSITION RONDODrill Quick GlanceAge: 9+Field: 7x14Players: 5Focus: PossessionDifficulty: MediumTime: 15 min.Goalkeeper: NoTeamRating: 0 / 5Views: 6,946Published: 9/2/2024Author: Chris JohnsonDrill ObjectiveThe 3v1 Transition Rondo drill emphasizes quick combination passing to unbalance the defender and shift the point of attack to an adjacent grid. This exercise challenges the defender to transition rapidly between areas, enhancing their ab",
    "category": "Possession",
    "age_group": "9+",
    "player_count": "5",
    "duration": "15 min.",
    "difficulty": "Medium",
    "has_goalkeeper": false,
    "setup_text": "1. Create two adjacent 7x7 yard grids, ultimately creating a 7x14 yard grid split in the middle. \n2. Divide players into groups of 5.\n3. Four attacking players start outside the four sides of the grid.\n4. Place a defender inside one of the grids.\n5. The two outside attackers on the long side of the grid must shift to the grid with the ball. ",
    "instructions_text": "1. The play starts with an attacking player passing to one of the three players who play a 3v1 rondo against the defender.\n2. Players can shift the ball to the adjacent grid at any point to the player at the end line, and the players along the outside must quickly shift to their grid to offer good supporting positions and angles.\n3. The defender also shits into the other grid playing a 3v1 rondo in this grid.\n4. Play continues until the defender wins the ball, or for some allotted time, such as 2 minutes, then rotate.",
    "variations_text": "• Add another defenderto increase the challenge, creating a 3v2+1 scenario.\n• Reduce the grid sizeto 5X5 yards to force quicker decision-making and sharper passes.\n• Limit touchesfor the attackers (e.g., two-touch maximum) to speed up play.",
    "coaching_points_text": "• Encourage quick, accurate passingand movement off the ball to create passing options.\n• Focus on quick transitionsbetween attack and defense to improve reaction time.\n• Teach players to think ahead,anticipating where the ball might go next.\n• Emphasize communicationamong players to maintain possession and identify when to transition.",
    "drill_json": {
      "name": "3v1 Transition Rondo",
      "description": "Two adjacent 7x7 yard grids creating a 7x14 yard playing area. Four attacking players positioned outside the grids play 3v1 rondo against one defender, with players shifting between grids to maintain possession.",
      "field": {
        "type": "HALF",
        "attacking_direction": "NORTH",
        "markings": false,
        "goals": 0
      },
      "players": [
        {
          "id": "A1",
          "role": "ATTACKER",
          "position": {
            "x": 50,
            "y": 44
          }
        },
        {
          "id": "A2",
          "role": "ATTACKER",
          "position": {
            "x": 56,
            "y": 50
          }
        },
        {
          "id": "A3",
          "role": "ATTACKER",
          "position": {
            "x": 50,
            "y": 62
          }
        },
        {
          "id": "A4",
          "role": "ATTACKER",
          "position": {
            "x": 44,
            "y": 50
          }
        },
        {
          "id": "D1",
          "role": "DEFENDER",
          "position": {
            "x": 51,
            "y": 48
          }
        }
      ],
      "cones": [
        {
          "position": {
            "x": 46,
            "y": 46
          }
        },
        {
          "position": {
            "x": 54,
            "y": 46
          }
        },
        {
          "position": {
            "x": 46,
            "y": 60
          }
        },
        {
          "position": {
            "x": 54,
            "y": 60
          }
        },
        {
          "position": {
            "x": 46,
            "y": 53
          }
        },
        {
          "position": {
            "x": 54,
            "y": 53
          }
        }
      ],
      "cone_gates": [],
      "balls": [
        {
          "position": {
            "x": 50,
            "y": 43
          }
        }
      ],
      "mannequins": [],
      "actions": [
        {
          "type": "PASS",
          "from_player": "A1",
          "to_player": "A2"
        },
        {
          "type": "PASS",
          "from_player": "A2",
          "to_player": "A3"
        },
        {
          "type": "RUN",
          "player": "A2",
          "to_position": {
            "x": 56,
            "y": 56
          }
        },
        {
          "type": "RUN",
          "player": "D1",
          "to_position": {
            "x": 51,
            "y": 56
          }
        },
        {
          "type": "RUN",
          "player": "A4",
          "to_position": {
            "x": 44,
            "y": 56
          }
        },
        {
          "type": "PASS",
          "from_player": "A3",
          "to_player": "A4"
        }
      ],
      "coaching_points": [
        "Quick ball movement to exploit numerical advantage",
        "Players must shift quickly when ball moves to adjacent grid",
        "Maintain good angles and spacing for passing options",
        "Defender should apply immediate pressure when ball switches grids"
      ],
      "variations": [
        "Limit touches to 2 per player",
        "Add time pressure (30 seconds per grid)",
        "Increase to 4v2 with two defenders"
      ]
    },
    "source": "soccerxpert.com",
    "source_url": "https://soccerxpert.com/drills/details/3v1-transition-rondo",
    "published_at": "2026-01-03T17:56:03.777690"
  },
  {
    "id": "d40bb695-c4b9-4aa1-a7e7-6fcad09c139d",
    "name": "1v1 Elimination Challenge",
    "description": "1v1 Elimination Challenge1v1 soccer drill, finishing, defending, transition play, competitive gameImagePrint1V1 SOCCER DRILL, FINISHING, DEFENDING, TRANSITION PLAY, COMPETITIVE GAMEDrill Quick GlanceAge: 7+Field: 20X30Players: 4+Focus: Game-likeDifficulty: EASYTime: 20 MINS.Goalkeeper: NOTeamRating: 0 / 5Views: 9,559Published: 2/14/2025Author: Chris JohnsonDrill ObjectiveThis drill sharpens 1v1 attacking, defending, and finishing under pressure. Players must react quickly after scoring, transiti",
    "category": "Dribbling",
    "age_group": "7+",
    "player_count": "4+",
    "duration": "20 MINS.",
    "difficulty": "EASY",
    "has_goalkeeper": false,
    "setup_text": "1. Field Size: 20x30 yards\n2. Goals: Two small goals (Pugg goals) on each end line\n3. Players: Two teams (red & blue) positioned outside the grid near the midline\n4. Ball Supply: Large supply of balls near the coach at midfield\n5. Roles:\nRed Team: Always defends one goal\nBlue Team: Always defends the opposite goal",
    "instructions_text": "1. The coach plays a ball into the field, and one player from each team enters to play 1v1.\n2. If a player scores, they stay on the field and quickly return to their half to receive another ball from the coach, making it a make-it-take-it style game.\n3. The player who concedes the goal is eliminated and leaves the game.\n4. A new defender from the eliminated player’s team immediately steps on, and play continues.\n5. If the ball goes out of bounds, both players return to their lines, and two new players enter to play.\n6. The game continues until one team eliminates all players from the opposing team.",
    "variations_text": "• Time Limit: Require attackers to score within 5-10 seconds to encourage urgency.\n• Weaker Foot Challenge: Players must finish with their weaker foot to improve balance and shooting ability.\n• Defensive Advantage: Give defenders a slight head start to increase difficulty for attackers.\n• Double Elimination: If a player scores two goals in a row, they can eliminate two opponents instead of one.\n• Team Rotation: If one team eliminates all opponents, mix up teams and restart to keep intensity high.",
    "coaching_points_text": "• Encourage Aggressive Attacking: Attackers should drive at defenders with pace and confidence.\n• Defensive Resilience: Defenders must stay disciplined and delay attackers rather than diving in.\n• Quick Transitions: Players should react instantly after scoring and be ready for the next play.\n• Finishing Under Pressure: Attackers must use precise shooting techniques to beat defenders and score.\n• Game Awareness: Players should anticipate when to attack space or shield the ball based on positioning.",
    "drill_json": {
      "name": "1v1 Elimination Challenge",
      "description": "A competitive 1v1 elimination game where players compete to score in small goals. Winners stay on to face the next challenger in make-it-take-it style gameplay until one team eliminates all opponents.",
      "field": {
        "type": "FULL",
        "attacking_direction": "NORTH",
        "markings": false,
        "goals": 0
      },
      "players": [
        {
          "id": "A1",
          "role": "ATTACKER",
          "position": {
            "x": 50,
            "y": 38
          }
        },
        {
          "id": "A2",
          "role": "ATTACKER",
          "position": {
            "x": 25,
            "y": 50
          }
        },
        {
          "id": "A3",
          "role": "ATTACKER",
          "position": {
            "x": 20,
            "y": 50
          }
        },
        {
          "id": "D1",
          "role": "DEFENDER",
          "position": {
            "x": 50,
            "y": 62
          }
        },
        {
          "id": "D2",
          "role": "DEFENDER",
          "position": {
            "x": 75,
            "y": 50
          }
        },
        {
          "id": "D3",
          "role": "DEFENDER",
          "position": {
            "x": 80,
            "y": 50
          }
        },
        {
          "id": "N1",
          "role": "NEUTRAL",
          "position": {
            "x": 70,
            "y": 58
          }
        }
      ],
      "cones": [
        {
          "position": {
            "x": 35,
            "y": 35
          }
        },
        {
          "position": {
            "x": 65,
            "y": 35
          }
        },
        {
          "position": {
            "x": 35,
            "y": 65
          }
        },
        {
          "position": {
            "x": 65,
            "y": 65
          }
        }
      ],
      "cone_gates": [
        {
          "id": "G1",
          "center": {
            "x": 50,
            "y": 35
          },
          "width": 4,
          "orientation": "HORIZONTAL"
        },
        {
          "id": "G2",
          "center": {
            "x": 50,
            "y": 65
          },
          "width": 4,
          "orientation": "HORIZONTAL"
        }
      ],
      "balls": [
        {
          "position": {
            "x": 50,
            "y": 50
          }
        },
        {
          "position": {
            "x": 48,
            "y": 48
          }
        },
        {
          "position": {
            "x": 52,
            "y": 48
          }
        }
      ],
      "mannequins": [],
      "actions": [
        {
          "type": "PASS",
          "from_player": "N1",
          "to_player": "A1"
        },
        {
          "type": "RUN",
          "player": "D1",
          "to_position": {
            "x": 50,
            "y": 55
          }
        },
        {
          "type": "DRIBBLE",
          "player": "A1",
          "to_position": {
            "x": 50,
            "y": 50
          }
        }
      ],
      "coaching_points": [
        "Quick decisions in 1v1 situations - attack or defend immediately",
        "Use body feints and change of pace to beat defender",
        "Defend goal side and force attacker to weaker foot",
        "Stay composed when shooting - accuracy over power",
        "Winners must quickly transition back to defend their goal"
      ],
      "variations": [
        "Add time limit (30 seconds) for each 1v1 battle",
        "Require specific moves (step-over, cut) before shooting",
        "Start with different ball positions (corners, wide areas)",
        "Add neutral player as target before attacking goal",
        "Play 2v2 elimination for more advanced players"
      ]
    },
    "source": "soccerxpert.com",
    "source_url": "https://soccerxpert.com/drills/details/1v1-elimination-challenge",
    "published_at": "2026-01-03T17:56:08.077819"
  },
  {
    "id": "eaa0c288-8c13-4108-b9bb-50d3f4f62261",
    "name": "4v4+3 Continuous Transition Rondo",
    "description": "4v4+3 Continuous Transition RondoRondo drill, 4v4+3, possession soccer, transition play, pressing, small-sided gameImagePrintRONDO DRILL, 4V4+3, POSSESSION SOCCER, TRANSITION PLAY, PRESSING, SMALL-SIDED GAMEDrill Quick GlanceAge: 13+Field: 10X20Players: 11+Focus: Game-likeDifficulty: HardTime: 20 MINS.Goalkeeper: NOTeamRating: 0 / 5Views: 4,220Published: 2/13/2025Author: Chris JohnsonDrill ObjectiveThis drill develops quick decision-making, first-touch passing, defensive pressing, and transition",
    "category": "Possession",
    "age_group": "13+",
    "player_count": "11+",
    "duration": "20 MINS.",
    "difficulty": "Hard",
    "has_goalkeeper": false,
    "setup_text": "1. Field Size: Two adjacent 10x10-yard grids (total 10x20 yards) marked by 6 cones\n2. Players: 11 total (3 possession players, 2 teams of 4)\n3. Roles:\nOrange (3 players): Always in possession (one inside, two on end lines)\nRed (4 players): Starts as outside possession team on the sidelines\nBlue (4 players): Starts as an inside defenders",
    "instructions_text": "1. The red team (4 players) and the orange team (3 players) maintain possession, using quick passing.\n2. The blue team (4 players) applies defensive pressure inside the grid to win the ball.\n3. If the blue team wins possession, they must quickly pass to an outside player, transitioning to the new possession team.\n4. Having lost possession, the red team immediately moves inside to defend.\n5. The game continues fluidly, with teams transitioning between possession and defending without stopping.\n6. Play in 3-5 minute rounds, emphasizing continuous movement and quick transitions.\n7. Rotate each team as the possession team.",
    "variations_text": "• Touch Restriction: Limit possession players to two touches max.\n• Man-Marking Challenge: Defenders must track specific players to increase defensive intensity.\n• Time-Limited Possession: Require possession teams to complete 6-8 passes before switching play.\n• Extra Defender: Add a neutral defensive player to increase difficulty for possession teams.\n• Directional Play: Designate one end line as the attacking side where possession must be played into before scoring a point.",
    "coaching_points_text": "• Quick Transitions: Players must react instantly when possession changes.\n• First-Touch Passing: Encourage sharp, precise one- or two-touch passing.\n• Support Play: Off-ball movement is crucial for creating passing angles.\n• Defensive Pressing: Defenders should work as a unit to force mistakes and win possession quickly.\n• Communication: Players must constantly talk to organize transitions and maintain possession.",
    "drill_json": {
      "name": "4v4+3 Continuous Transition Rondo",
      "description": "Possession drill with continuous transitions between attacking and defending roles. Orange team maintains possession with red team, while blue team defends. When possession is lost, teams immediately switch roles.",
      "field": {
        "type": "FULL",
        "attacking_direction": "NORTH",
        "markings": false,
        "goals": 0
      },
      "players": [
        {
          "id": "N1",
          "role": "NEUTRAL",
          "position": {
            "x": 51,
            "y": 51
          }
        },
        {
          "id": "N2",
          "role": "NEUTRAL",
          "position": {
            "x": 49,
            "y": 39
          }
        },
        {
          "id": "N3",
          "role": "NEUTRAL",
          "position": {
            "x": 51,
            "y": 61
          }
        },
        {
          "id": "A1",
          "role": "ATTACKER",
          "position": {
            "x": 42,
            "y": 45
          }
        },
        {
          "id": "A2",
          "role": "ATTACKER",
          "position": {
            "x": 42,
            "y": 55
          }
        },
        {
          "id": "A3",
          "role": "ATTACKER",
          "position": {
            "x": 58,
            "y": 45
          }
        },
        {
          "id": "A4",
          "role": "ATTACKER",
          "position": {
            "x": 58,
            "y": 55
          }
        },
        {
          "id": "D1",
          "role": "DEFENDER",
          "position": {
            "x": 47,
            "y": 46
          }
        },
        {
          "id": "D2",
          "role": "DEFENDER",
          "position": {
            "x": 53,
            "y": 47
          }
        },
        {
          "id": "D3",
          "role": "DEFENDER",
          "position": {
            "x": 47,
            "y": 54
          }
        },
        {
          "id": "D4",
          "role": "DEFENDER",
          "position": {
            "x": 54,
            "y": 54
          }
        }
      ],
      "cones": [
        {
          "position": {
            "x": 45,
            "y": 40
          }
        },
        {
          "position": {
            "x": 55,
            "y": 40
          }
        },
        {
          "position": {
            "x": 45,
            "y": 50
          }
        },
        {
          "position": {
            "x": 55,
            "y": 50
          }
        },
        {
          "position": {
            "x": 45,
            "y": 60
          }
        },
        {
          "position": {
            "x": 55,
            "y": 60
          }
        }
      ],
      "cone_gates": [],
      "balls": [
        {
          "position": {
            "x": 50,
            "y": 50
          }
        }
      ],
      "mannequins": [],
      "actions": [
        {
          "type": "PASS",
          "from_player": "N1",
          "to_player": "A1"
        },
        {
          "type": "PASS",
          "from_player": "A1",
          "to_player": "N2"
        },
        {
          "type": "PASS",
          "from_player": "N2",
          "to_player": "A3"
        }
      ],
      "coaching_points": [
        "Quick passing under pressure to maintain possession",
        "Immediate transition when possession changes hands",
        "Constant movement and communication",
        "Use neutral players to switch the point of attack",
        "Compact defending when not in possession"
      ],
      "variations": [
        "Add touch restrictions (2-touch maximum)",
        "Increase grid size for more space",
        "Add time pressure - possession team must complete 8 passes",
        "Use different grid shapes (circular, triangular)"
      ]
    },
    "source": "soccerxpert.com",
    "source_url": "https://soccerxpert.com/drills/details/4v3-plus-3-continuous-transaction-rondo",
    "published_at": "2026-01-03T17:56:12.080622"
  },
  {
    "id": "5b149576-09ad-4d80-9da5-fdbc972cef40",
    "name": "Y Passing Drill - Variation 1",
    "description": "Y Passing Drill - Variation 1y passing drill, movement off the ball, receiving, body positioning, first touchImagePrintY PASSING DRILL, MOVEMENT OFF THE BALL, RECEIVING, BODY POSITIONING, FIRST TOUCHDrill Quick GlanceAge: 9+Field: 15x20Players: 5+Focus: COMBINATIONDifficulty: MEDIUMTime: 20 MINS.Goalkeeper: NOTeamRating: 0 / 5Views: 10,730Published: 2/19/2025Author: Chris JohnsonDrill ObjectiveDevelops players' ability to receive with an open body position, execute accurate passes, and transitio",
    "category": "Passing",
    "age_group": "9+",
    "player_count": "5+",
    "duration": "20 MINS.",
    "difficulty": "MEDIUM",
    "has_goalkeeper": false,
    "setup_text": "1. Use four cones to form a “Y” shape.\n2. The base cone (#1) is 15 yards from the center cone (#2).\n3. The top cones (#3 and #4) are 10 yards from the center cone.\n4. Assign 5-6 players per setup, with one player at each cone and extra players lined up at cone #1.\n5. Use two balls per Y formation to keep the pace high.",
    "instructions_text": "1. Player 1 (at base) passes to Player 2 (center).\n2. Player 2 receives with an open body and plays to Player 3 (top left).\n3. Player 3 dribbles quickly back to cone #1 and passes to the next player in line.\n4. Players rotate positions by following their pass.\n5. The sequence repeats with Player 1 passing to Player 2, but this time Player 2 plays to Player 4 (top right).\n6. Player 4 dribbles back to cone #1 and plays the ball to the next player in line.\n7. The drill continues with players moving through each position.",
    "variations_text": "• For multiple Y's set up, have a relay race where each player must complete the passing pattern twice.\n• Require one-touch passing for advanced players.\n• Increase the passing distance to challenge long-range accuracy.\n• Add a time constraint to increase game speed.\n• Reverse the passing pattern to develop both feet.\n• Add a passive defender at cone #2 to create pressure on Player 2’s first touch.",
    "coaching_points_text": "• Emphasize receiving with an open body to play forward quickly.\n• Encourage firm, accurate passes to keep the drill flowing.\n• Focus on quick decision-making and scanning before receiving.\n• Ensure players dribble at speed when returning to the start.\n• Reinforce communication and awareness to execute clean rotations.",
    "drill_json": {
      "name": "Y Passing Drill - Variation 1",
      "description": "Technical passing drill using a Y-shaped cone formation to practice receiving with an open body, switching play, and player rotation following passes.",
      "field": {
        "type": "FULL",
        "attacking_direction": "NORTH",
        "markings": false,
        "goals": 0
      },
      "players": [
        {
          "id": "A1",
          "role": "ATTACKER",
          "position": {
            "x": 51,
            "y": 29
          }
        },
        {
          "id": "A2",
          "role": "ATTACKER",
          "position": {
            "x": 51,
            "y": 46
          }
        },
        {
          "id": "A3",
          "role": "ATTACKER",
          "position": {
            "x": 38,
            "y": 58
          }
        },
        {
          "id": "A4",
          "role": "ATTACKER",
          "position": {
            "x": 61,
            "y": 57
          }
        },
        {
          "id": "A5",
          "role": "ATTACKER",
          "position": {
            "x": 50,
            "y": 27
          }
        }
      ],
      "cones": [
        {
          "position": {
            "x": 50,
            "y": 30
          }
        },
        {
          "position": {
            "x": 50,
            "y": 45
          }
        },
        {
          "position": {
            "x": 40,
            "y": 55
          }
        },
        {
          "position": {
            "x": 60,
            "y": 55
          }
        }
      ],
      "cone_gates": [],
      "balls": [
        {
          "position": {
            "x": 50,
            "y": 30
          }
        },
        {
          "position": {
            "x": 48,
            "y": 28
          }
        }
      ],
      "mannequins": [],
      "actions": [
        {
          "type": "PASS",
          "from_player": "A1",
          "to_player": "A2"
        },
        {
          "type": "PASS",
          "from_player": "A2",
          "to_player": "A3"
        },
        {
          "type": "DRIBBLE",
          "player": "A3",
          "to_position": {
            "x": 49,
            "y": 27
          }
        },
        {
          "type": "RUN",
          "player": "A1",
          "to_position": {
            "x": 50,
            "y": 45
          }
        },
        {
          "type": "RUN",
          "player": "A2",
          "to_position": {
            "x": 40,
            "y": 55
          }
        }
      ],
      "coaching_points": [
        "Receive with an open body at the center cone",
        "Quick, accurate passes to maintain tempo",
        "Players rotate by following their pass",
        "Use both balls to keep high intensity"
      ],
      "variations": [
        "Add time pressure with a countdown",
        "Require specific touches (one-touch, two-touch)",
        "Increase distance between cones"
      ]
    },
    "source": "soccerxpert.com",
    "source_url": "https://soccerxpert.com/drills/details/y-passing-drill-variation-1",
    "published_at": "2026-01-03T17:56:15.440275"
  },
  {
    "id": "c25f3a2f-a6b5-4dda-aa12-ee2a897c69a1",
    "name": "3v3 to Goals",
    "description": "3v3 to Goals3v3 soccer, small-sided game, attacking, defending, transition playImagePrint3V3 SOCCER, SMALL-SIDED GAME, ATTACKING, DEFENDING, TRANSITION PLAYDrill Quick GlanceAge: 4+Field: 20X30Players: 6+Focus: Game-likeDifficulty: MEDIUMTime: 20 MINS.Goalkeeper: NOTeamRating: 0 / 5Views: 6,949Published: 2/16/2025Author: Chris JohnsonDrill ObjectiveThis drill develops players' ability to attack and defend in small spaces while encouraging quick decision-making, teamwork, and fitness through cons",
    "category": "Small Sided Games",
    "age_group": "4+",
    "player_count": "6+",
    "duration": "20 MINS.",
    "difficulty": "MEDIUM",
    "has_goalkeeper": false,
    "setup_text": "1. Field Size: 20x30 yards\n2. Goals: Two goals, one at each end line (cones, training sticks, or small goals)\n3. Players: Two teams, rotating substitutes\n4. Ball Supply: Multiple soccer balls with the coach\n5. Starting Positions: 3 players per team on the field, substitutes waiting near the coach",
    "instructions_text": "1. Divide players into two teams and assign each team a goal to defend.\n2. Play begins with a kickoff or coach's pass-in.\n3. Teams compete 3v3, working to score while defending their goal.\n4. After 1-2 minutes, rotate one player from each team off and a new player on to keep legs fresh.\n5. If there are 12 or more players, run a second 3v3 game, rotating teams every 3-4 minutes.\n6. Play continues with quick rotations, ensuring all players get equal playtime.",
    "variations_text": "• Touch Restriction: Limit players to two touches to encourage faster play.\n• Weaker Foot Challenge: Players must shoot using their weaker foot.\n• Man-Marking Challenge: Each player must mark a specific opponent at all times.\n• Bonus Points: Award an extra point for a goal scored after three consecutive passes.\n• Different Scoring Zones: Require players to shoot from inside a designated area for a goal to count.",
    "coaching_points_text": "• Encourage Quick Decision-Making: Players must react fast in attacking and defensive situations.\n• Support & Movement Off the Ball: Players should create passing options and space.\n• Defensive Organization: Defenders must communicate and work as a unit.\n• Transition Play: Quickly transition from defense to attack and vice versa.\n• Finishing Under Pressure: Players should take quick, accurate shots when opportunities arise.",
    "drill_json": {
      "name": "3v3 to Goals",
      "description": "Small-sided game where two teams compete 3v3 in a 20x30 yard field, trying to score in opposite goals with regular player rotations to keep intensity high.",
      "field": {
        "type": "HALF",
        "attacking_direction": "NORTH",
        "markings": false,
        "goals": 0
      },
      "players": [
        {
          "id": "D1",
          "role": "DEFENDER",
          "position": {
            "x": 47,
            "y": 46
          }
        },
        {
          "id": "A2",
          "role": "ATTACKER",
          "position": {
            "x": 60,
            "y": 55
          }
        },
        {
          "id": "A3",
          "role": "ATTACKER",
          "position": {
            "x": 40,
            "y": 60
          }
        },
        {
          "id": "A1",
          "role": "ATTACKER",
          "position": {
            "x": 48,
            "y": 53
          }
        },
        {
          "id": "D2",
          "role": "DEFENDER",
          "position": {
            "x": 62,
            "y": 50
          }
        },
        {
          "id": "D3",
          "role": "DEFENDER",
          "position": {
            "x": 37,
            "y": 53
          }
        }
      ],
      "cones": [
        {
          "position": {
            "x": 35,
            "y": 40
          }
        },
        {
          "position": {
            "x": 35,
            "y": 55
          }
        },
        {
          "position": {
            "x": 65,
            "y": 40
          }
        },
        {
          "position": {
            "x": 65,
            "y": 55
          }
        },
        {
          "position": {
            "x": 35,
            "y": 70
          }
        },
        {
          "position": {
            "x": 65,
            "y": 70
          }
        }
      ],
      "cone_gates": [
        {
          "id": "G1",
          "center": {
            "x": 50,
            "y": 40
          },
          "width": 4,
          "orientation": "HORIZONTAL"
        },
        {
          "id": "G2",
          "center": {
            "x": 50,
            "y": 70
          },
          "width": 4,
          "orientation": "HORIZONTAL"
        }
      ],
      "balls": [
        {
          "position": {
            "x": 50,
            "y": 55
          }
        }
      ],
      "mannequins": [],
      "actions": [
        {
          "type": "PASS",
          "from_player": "D1",
          "to_player": "D3"
        }
      ],
      "coaching_points": [
        "Quick combination play to create scoring opportunities",
        "Immediate pressure when losing possession",
        "Communication and support play in tight spaces",
        "Quick transitions between attack and defense"
      ],
      "variations": [
        "Add neutral players for overload situations",
        "Limit touches (2-touch maximum)",
        "Add multiple balls for increased intensity",
        "Vary field dimensions (wider for possession, narrower for intensity)"
      ]
    },
    "source": "soccerxpert.com",
    "source_url": "https://soccerxpert.com/drills/details/3v3-to-goals",
    "published_at": "2026-01-03T17:56:18.577236"
  },
  {
    "id": "3d806d38-072e-468f-9cb1-094ab399725c",
    "name": "Simple Obstacle Course",
    "description": "Simple Obstacle Courseagility, dribble, and shooting, obstacle courseImagePrintAGILITY, DRIBBLE, AND SHOOTING, OBSTACLE COURSEDrill Quick GlanceAge: 4-8Field: 10x20Players: 10+Focus: AgilityDifficulty: EasyTime: 10 min.Goalkeeper: NoTeamRating: 0 / 5Views: 14,483Published: 8/23/2024Author: Chris JohnsonDrill ObjectiveThis simple obstacle course is fun for young players and focuses on agility, dribbling, and scoring goals. This simple, fun obstacle course develops young players' agility, dribblin",
    "category": "Warm Up",
    "age_group": "4-8",
    "player_count": "10+",
    "duration": "10 min.",
    "difficulty": "Easy",
    "has_goalkeeper": false,
    "setup_text": "1. Set up an obstacle course using cones.\n2. Create a starting point by placing a cone about 3 yards from where you will place the first \"hurdle obstacle.\" The hurdle can be short or tall cones or an agility hurdle.\n3. Three yards from the starting cone, set 3-5 hurdle obstacles about 1-yard apart.\n4. Using training sticks or cones, create a line of 4 to 6 sticks approximately 3 yards apart. Closer for more skilled dribblers.\n7. Set a Pugg or small soccer goal about 8-10 yards from the last training stick.\n8. Each player starts with a soccer ball at the beginning of the course.",
    "instructions_text": "1. Players begin at the start of the obstacle course with their ball.\n2. On the coach's signal, the first player passes to the coach and performs some agility technique over or around the hurdles.\n3. When the player reaches the end of the hurdles, the coach passes the ball back to the player, who slalom dribbles through the set of training sticks.\n4. Next, the player will dribble a few touches and have a shot on goal.\n5. The player should collect their ball and return to the starting point.\n6. Encourage players to use both feet and different parts of the foot to maneuver the ball.",
    "variations_text": "• Make it a competition by counting the times the players score",
    "coaching_points_text": "• Encourage players to use both feet and different parts of the foot to dribble\n• Encourage players to keep the ball close when navigating around the sticks\n• Teach players to look up as much as possible\n• Emphasize quick light touches to maintain control",
    "drill_json": {
      "name": "Simple Obstacle Course",
      "description": "Players complete an obstacle course involving agility hurdles, slalom dribbling through training sticks, and finishing with a shot on goal",
      "field": {
        "type": "HALF",
        "attacking_direction": "NORTH",
        "markings": false,
        "goals": 0
      },
      "players": [
        {
          "id": "A1",
          "role": "ATTACKER",
          "position": {
            "x": 50,
            "y": 20
          }
        },
        {
          "id": "N1",
          "role": "NEUTRAL",
          "position": {
            "x": 41,
            "y": 36
          }
        }
      ],
      "cones": [
        {
          "position": {
            "x": 50,
            "y": 23
          }
        },
        {
          "position": {
            "x": 50,
            "y": 26
          }
        },
        {
          "position": {
            "x": 50,
            "y": 28
          }
        },
        {
          "position": {
            "x": 50,
            "y": 30
          }
        },
        {
          "position": {
            "x": 50,
            "y": 32
          }
        },
        {
          "position": {
            "x": 50,
            "y": 38
          }
        },
        {
          "position": {
            "x": 50,
            "y": 41.5
          }
        },
        {
          "position": {
            "x": 50,
            "y": 45
          }
        },
        {
          "position": {
            "x": 50,
            "y": 48.5
          }
        }
      ],
      "cone_gates": [
        {
          "id": "G1",
          "center": {
            "x": 50,
            "y": 62
          },
          "width": 5,
          "orientation": "HORIZONTAL"
        }
      ],
      "balls": [
        {
          "position": {
            "x": 50,
            "y": 20
          }
        }
      ],
      "mannequins": [],
      "actions": [
        {
          "type": "PASS",
          "from_player": "A1",
          "to_player": "N1"
        },
        {
          "type": "RUN",
          "player": "A1",
          "to_position": {
            "x": 50,
            "y": 35
          }
        },
        {
          "type": "PASS",
          "from_player": "N1",
          "to_player": "A1"
        },
        {
          "type": "DRIBBLE",
          "player": "A1",
          "to_position": {
            "x": 50,
            "y": 52
          }
        }
      ],
      "coaching_points": [
        "Encourage players to use both feet during dribbling",
        "Focus on different parts of the foot to maneuver the ball",
        "Maintain control while moving through obstacles at pace",
        "Keep head up during slalom dribbling to see the goal"
      ],
      "variations": [
        "Vary the spacing between training sticks based on skill level",
        "Add time pressure by timing each player's completion",
        "Use different types of hurdle obstacles (short cones, agility hurdles)",
        "Require specific finishing techniques (inside foot, outside foot, weak foot)"
      ]
    },
    "source": "soccerxpert.com",
    "source_url": "https://soccerxpert.com/drills/details/simple-obstacle-course",
    "published_at": "2026-01-03T17:56:23.176756"
  }
]